app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "category", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "タイトル"], ["category", "カテゴリ"], ["body", "本文"], ["created_at", "2021-11-05 00:25:15.713365"], ["updated_at", "2021-11-05 00:25:15.713365"]]
---
  def create
    @blog = Blog.new(blog_params)
    if @blog.save

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def update
    blog = Blog.find(params[:id])